ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Digbo"], ["description", ""], ["updated_at", "2018-12-18 21:30:03.474176"], ["id", 1]]
---
  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)